Workspace/projectUserDir/src/libWallModelledLES/tests/testCases/channel_flow/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//New fast merging in of 3.0.1
fastMerge yes;

convertToMeters 1;

vertices
(
    (0 0 0)
    (9 0 0)
    (0 1 0)
    (9 1 0)
    (0 2 0)
    (9 2 0)
    (0 0 4)
    (9 0 4)
    (0 1 4)
    (9 1 4)
    (0 2 4)
    (9 2 4)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) (3 5 3) simpleGrading (1 1 1)
    hex (2 3 5 4 8 9 11 10) (3 5 3) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type            cyclic;
        neighbourPatch  outlet;
        faces           ((0 6 8 2) (2 8 10 4));
    }

    outlet
    {
        type            cyclic;
        neighbourPatch  inlet;
        faces           ((1 3 9 7) (3 5 11 9));
    }

    bottomWall
    {
        type            wall;
        faces           ((0 1 7 6));
    }
    topWall
    {
        type            wall;
        faces           ((4 10 11 5));
    }

    left
    {
        type            cyclic;
        neighbourPatch  right;
        faces           ((0 2 3 1) (2 4 5 3));
    }

    right
    {
        type            cyclic;
        neighbourPatch  left;
        faces           ((6 7 9 8) (8 9 11 10));
    }

    
);

mergePatchPairs
(
);

// ************************************************************************* //
