Workspace/projectUserDir/src/libWallModelledLES/tests/testCases/channel_flow/system/decomposeParDict
FoamFile
{
        version         2.0;
        format          ascii;
             
        root            "";
        case            "";
        instance        "";
        local           "";
                              
        class           dictionary;
        object          decomposeParDict;
}
 
 // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
  
   
numberOfSubdomains 2;
    
//method          scotch;
method    simple;
simpleCoeffs
{
    n               (1 2 1);
    delta           0.001;
}
