Workspace/projectUserDir/src/libWallModelledLES/tests/testCases/channel_flow/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type            meanVelocityForce; 
    active          on;            //on/off switch

    meanVelocityForceCoeffs
    {
        selectionMode   all;       //cellSet // points //cellZone
        fieldNames  (U);
        fields  (U);
        Ubar        ( 1 0 0 );
    }
}


// ************************************************************************* //
