Workspace/projectUserDir/src/libWallModelledLES/tests/testCases/channel_flow/system/setNutPGradODEDuprat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nut 
{
    boundaryField
    {
        bottomWall
        {
            type            PGradODEWallModel;
            value           uniform 0;

            nMeshY    50;
        
            EddyViscosity
            {
                    type    Duprat;
            }
        }
    }
}

// ************************************************************************* //
